//------------------------------------------------------------------------------
// fraction.cpp - содержит функции обработки простой дроби
//------------------------------------------------------------------------------

#include "fraction.h"

//------------------------------------------------------------------------------
// Ввод параметров простой дроби из потока
void In(fraction &t, FILE &ifst) {
    // ifst >> t.a >> t.b;
    fscanf(&ifst, "%d%d", &t.a, &t.b);
    if (t.b == 0) {
        printf("%s", "Incorrect input values.\nDenominator must not be zero");
        exit(0);
    }
}

// Случайный ввод параметров простой дроби
void InRnd(fraction &t) {
    t.a = Random();
    do {
        t.b = Random();
    } while(t.b==0);
}

//------------------------------------------------------------------------------
// Вывод параметров простой дроби в поток
void Out(fraction &t, FILE &ofst) {
    /*ofst << "It is Fraction: a = " 
         << t.a << ", b = " << t.b
         << ". Real = " << Real(t) << "\n";*/
    fprintf(&ofst, "%s%d%s%d%s%g%s", "It is Fraction: a = "
        , t.a, ", b = ", t.b
        , ". Real = ", Real(t), "\n");
}

//------------------------------------------------------------------------------
// Приведение простой дроби к действительномму числу
double Real(fraction &t) {
    return double(t.a) / t.b ;
}
