#ifndef __fraction__
#define __fraction__

//------------------------------------------------------------------------------
// fraction.h - содержит описание простой дроби
//------------------------------------------------------------------------------

#include "stdio.h"
#include "rnd.h"

//------------------------------------------------------------------------------
// простая дробь
struct fraction {
    int a, b; // числитель и знаменатель
};

// Ввод параметров простой дроби из файла
void In(fraction &t, FILE &ifst);

// Случайный ввод параметров простой дроби
void InRnd(fraction &е);

// Вывод параметров простой дроби в форматируемый поток
void Out(fraction &t, FILE &ofst);

// Приведение простой дроби к действительному числу
double Real(fraction &t);

#endif //__fraction__
